// ------------ ЗАДАНИЕ ------------ //
// Каким будет результат этих выражений?
5 > 4
"ананас" > "яблоко"
"2" > "12"
undefined == null
undefined === null
null == "\n0\n"
null === +"\n0\n"


// ------------ РЕШЕНИЕ ------------ //
/*
	1. true
	Объяснение:
	5 больше 4-х
	
	2. false
	Объяснение:
	'а' первая в алфавите
	
	3. true 
	Объяснение:
	'2' бльше '1' (предполагаю, что объяснение может быть ложным)
	
	4. true
	Объяснение:
	просто потому что:)
	
	5. false
	Объяснение:
	Cтрогое сравнение, а типы разные
	
	6. false
	Объяснение:
	null не равен нулю, однако при null >= 0 был бы true

	7. false
	Обяснение:
	сравнение строгое
*/